{
  "title": "Legnicki Meetup Technologiczny #2",
  "datetime": "2024-09-12 18:00:00",
  "place": "Legnicki Browar Książęcy",
  "localization": "https://maps.app.goo.gl/MFfX39G6NrAerXWd6",
  "lineup": [
    {
      "name": "Przemysław",
      "surname": "Sokołowski",
      "role": "software engineer i tech lead",
      "companies": [
        {
          "name": "Synergy Codes",
          "url": "https://www.synergycodes.com/"
        }
      ],
      "avatarUrl": "przemyslaw-sokolowski.jpg",
      "about": "Przemek to software engineer i tech lead w Synergy Codes. Na co dzień pracuje z różnorodnymi technologiami, takimi jak .NET, NestJS, Vue, Angular i React. Kluczowe dla niego jest dostosowanie technologii do konkretnego rozwiązania, ponieważ nie każde narzędzie pasuje do każdego przypadku. Przemek wierzy, że elastyczność w doborze technologii jest niezbędna do tworzenia efektywnych i skalowalnych rozwiązań."
    },
    {
      "name": "Piotr",
      "surname": "Dobrowolski",
      "role": "lider zespołu .NET",
      "companies": [
        {
          "name": "Softiq sp. z o.o.",
          "url": "https://softiq.pl/"
        }
      ],
      "avatarUrl": "piotr-dobrowolski.jpeg",
      "about": "Dzięki dogłębnej wiedzy w zakresie technologii .NET oraz umiejętnościom zarządzania zespołem, Piotr potrafi skutecznie kierować projektami, dbając o terminowość i efektywność realizacji zadań. Jego zaangażowanie w rozwój zespołu i chęć dzielenia się wiedzą sprawiają, że jest cenionym mentorem, który inspiruje innych do osiągania coraz wyższych standardów w pracy."
    },
    {
      "name": "Patryk",
      "surname": "Mauer",
      "role": "",
      "companies": [
        {
          "name": "Blumilk sp. z o.o.",
          "url": "https://www.blumilk.pl/"
        }
      ],
      "avatarUrl": "patryk-mauer.jpg",
      "about": "Doktorant na Politechnice Opolskiej w dyscyplinie Informatyka Techniczna i Telekomunikacja, współwłaściciel Epicentrum Art Gallery w Opolu oraz firmy informatycznej IT Goal sp. z o.o. Jego zainteresowania to automatyzacja i robotyzacja procesów biznesowych, w tym z wykorzystaniem uczenia maszynowego."
    }
  ],
  "agenda": [
    {
      "start": "18:00",
      "title": "Krótka opowieść o LMT i przywitanie gości"
    },
    {
      "start": "18:15",
      "title": "HDD, czyli jak można zgubić się w projekcie",
      "speaker": "Przemysław Sokołowski",
      "description": "W mojej prezentacji przedstawię prawdziwe przykłady sytuacji, gdzie decyzje pod wpływem HDD prowadziły do tworzenia długu technologicznego i spadku jakości projektów. Zobaczymy, jak takie wybory wpływają na wydajność zespołu, stabilność systemu i długoterminowe utrzymanie kodu.\nDodatkowo, podzielę się praktycznymi wskazówkami, jak unikać pułapek HDD i podejmować bardziej świadome decyzje technologiczne. Pokażę, jak znaleźć równowagę między nowinkami a stabilnością, żeby tworzyć trwałe i efektywne rozwiązania."
    },
    {
      "start": "19:00",
      "title": "Wprowadzenie do generatorów kodu źródłowego w C#",
      "speaker": "Piotr Dobrowolski",
      "description": "W swojej prezentacji opowiem o roli generatorów kodów w C#. Pokażę zaawansowane techniki i wzorce, które łatwo i przyjemnie zastosujecie w realnych projektach. Pokażę przykłady z rzeczywistych aplikacji, gdzie generatory kodu mogą przyspieszyć rozwój."
    },
    {
      "start": "19:45",
      "title": "Przerwa"
    },
    {
      "start": "20:00",
      "title": "Przewidywanie wyników aukcyjnych dzieł sztuki",
      "speaker": "Patryk Mauer",
      "description": " Patryk w swojej prezentacji skupi się na omówieniu kluczowych cech i zmiennych, które najbardziej wpływają na trafność prognoz przyszłych wyników aukcyjnych oraz na przedstawieniu najskuteczniejszych modeli uczenia maszynowego stosowanych w tym kontekście. Wskaże również, jakie strategie można przyjąć, aby maksymalizować precyzję przewidywań. Dzięki zastosowaniu nowoczesnych technologii i podejść analitycznych, uczestnicy prezentacji zdobędą wiedzę niezbędną do lepszego zrozumienia mechanizmów rządzących rynkiem sztuki i podejmowania bardziej świadomych, data-driven decyzji."
    },
    {
      "start": "20:45",
      "title": "Networking"
    }
  ],
  "patrons": [
    {
      "name": "Collegium Witelona Uczelnia Państwowa",
      "website": "https://collegiumwitelona.pl/",
      "logoUrl": "cwup.png"
    }
  ],
  "partners": [
    {
      "name": "Synergy Codes",
      "url": "https://www.synergycodes.com/",
      "logoUrl": "synergy-codes.png"
    }
  ],
  "sponsors": [
    {
      "name": "Softiq",
      "website": "https://softiq.pl/",
      "logoUrl": "softiq.png"
    }
  ],
  "gallery": []
}
