{
  "title": "Legnicki Meetup Technologiczny #3",
  "datetime": "2025-02-20 18:00:00",
  "place": "Legnicki Browar Książęcy",
  "localization": "https://maps.app.goo.gl/MFfX39G6NrAerXWd6",
  "lineup": [
    {
      "name": "Łukasz",
      "surname": "Tkacz",
      "role": "DevOps Team Lead",
      "companies": [
        {
          "name": "Ingenious.BUILD",
          "url": "https://www.ingenious.build/"
        }
      ],
      "avatarUrl": "lukasz-tkacz.webp",
      "about": "Łukasz zajmuje się infrastrukturą, obsługą CI/CD i wsparciem deweloperów w ich codziennej pracy. Wcześniej pracował jako programista full-stack (Laravel, Vue), a obecnie stara się więc łączyć oba te światy, aby lepiej rozwiązywać problemy i wspomagać dostarczanie oprogramowania. W wolnym czasie górski ultramaratończyk, co rzutuje też na pracę – nie ma rzeczy niemożliwych, to tylko kwestia czasu.",
      "presentationTitle": "",
      "presentationUrl": "",
      "videoUrl": ""
    },
    {
      "name": "Kamil",
      "surname": "Piech",
      "role": "Inżynier oprogramowania",
      "companies": [
        {
          "name": "Blumilk sp. z o.o.",
          "url": "https://www.blumilk.pl/"
        }
      ],
      "avatarUrl": "kamil-piech.webp",
      "about": "Inżynier oprogramowania w Blumilk, wykładowca Collegium Witelona Uczelnia Państwowa w Legnicy, a po godzinach – freelancer. Fullstack developer specjalizujący się w PHP, Laravelu i Vue.js, choć nie stroni od technologii mobilnych, gdy projekt tego wymaga. Po pracy, zamiast spędzać kolejne godziny przed monitorem, można go spotkać na szutrowych trasach i leśnych ścieżkach.",
      "presentationTitle": "",
      "presentationUrl": "",
      "videoUrl": ""
    },
    {
      "name": "Szymon",
      "surname": "Sandura",
      "role": ".NET Backend Developer",
      "companies": [
        {
          "name": "Iteo sp. z o.o.",
          "url": "https://iteo.com/"
        }
      ],
      "avatarUrl": "szymon-sandura.webp",
      "about": "Szymon projektuje systemy o różnej skali, specjalizuje się w architekturze rozproszonej oraz w systemach wspieranych wyszukiwaniem semantycznym i technologią RAG. Jego praca to nie tylko pisanie kodu – to także poszukiwanie optymalnych rozwiązań dla najbardziej wymagających wyzwań technologicznych. Po godzinach oddaje się swojej wieloletniej pasji – grze na instrumentach. Już od 25 lat rozwija swoje muzyczne zdolności, sięgając po różnorodne instrumenty.",
      "presentationTitle": "",
      "presentationUrl": "",
      "videoUrl": ""
    }
  ],
  "agenda": [
    {
      "start": "18:00",
      "title": "Otwarcie spotkania"
    },
    {
      "start": "18:30",
      "title": "DevOps dla programistów. Jak wspólnie tworzyć lepszy kod?",
      "speaker": "Łukasz Tkacz",
      "description": "Łukasz w swojej prezentacji przedstawi, że tworzenie aplikacji lub usługi to nie tylko napisanie kodu - ten musi zostać sprawdzony, a następnie dostarczony do klienta. W prezentacji pochylimy się nad zagadnieniami CI/CD oraz związanymi z nimi metrykami i sposobami ich zbierania."
    },
    {
      "start": "19:15",
      "title": "Przerwa"
    },
    {
      "start": "19:30",
      "title": "No-code na przykładzie FlutterFlow: czy tak będziemy 'programować' w przyszłości?",
      "speaker": "Kamil Piech",
      "description": "Kamil opowie o platformie no-code FlutterFlow, która umożliwia tworzenie aplikacji mobilnych (i nie tylko) bez konieczności pisania kodu. W trakcie prezentacji pokaże, jak działa to narzędzie, i przedstawi jego możliwości, ograniczenia oraz potencjał.\nPoruszony zostanie również temat przyszłości takich rozwiązań – czy no-code ma szansę zdominować rynek programistyczny, czy pozostanie narzędziem wykorzystywanym głównie do tworzenia MVP i PoC?"
    },
    {
      "start": "20:15",
      "title": "Przerwa"
    },
    {
      "start": "20:30",
      "title": "Gameboy w języku C#: Podstawy emulacji niskopoziomowej",
      "speaker": "Szymon Sandura",
      "description": "Szymon zaprezentuje fascynujący świat emulacji, przenosząc uczestników w świat Retro Game Devu. Omówi podstawy emulacji niskopoziomowej, tajniki architektury konsoli Gameboy oraz proces tworzenia własnego emulatora w .NET. Na przykładzie autorskiego projektu pokaże, jak testować i optymalizować wydajność emulatora w języku C#."
    },
    {
      "start": "21:15",
      "title": "Networking"
    }
  ],
  "sponsors": [
    {
      "name": "Softiq",
      "website": "https://softiq.pl/",
      "logoUrl": "softiq.webp"
    }
  ],
  "partners": [],
  "patrons": [
    {
      "name": "Collegium Witelona Uczelnia Państwowa",
      "website": "https://collegiumwitelona.pl/",
      "logoUrl": "cwup.webp"
    },
    {
      "name": "Miasto Legnica",
      "website": "https://prezydent.legnica.eu/",
      "logoUrl": "legnica.webp"
    },
    {
      "name": "Legnicka Specjalna Strefa Ekonomiczna S.A.",
      "website": "https://lsse.eu/",
      "logoUrl": "lsse.webp"
    }
  ],
  "partnersGridCols": 2,
  "gallery": [],
  "photographers": "",
  "regulations": ""
}
